{
  "id": "mil_straz_barbakan",
  "subjectEntityId": "brama_florianska",
  "title": "Straż i współpraca z Barbakanem",
  "content": "Strażnicy kontrolowali wjazdy, pobierali cła i w razie ataku bronili dostępu do miasta. W górnych kondygnacjach znajdowały się stanowiska dla łuczników, kuszników i później strzelców. Brama była zarówno punktem codziennej pracy, jak i miejscem narażonym na ataki. W XV wieku dobudowano Barbakan jako wysunięte przedbramie, połączone z Bramą Floriańską krytym przejściem. Barbakan przejmował pierwszy impet ataku, a napastnicy musieli pokonać długi, ciasny korytarz zanim dotarli do bramy. Ten system czynił krakowskie fortyfikacje wyjątkowo skutecznymi.",
  "mediaIds": [
    "img_mil_barbakan"
  ],
  "importance": 84,
  "thematicScores": {
    "military": 95
  },
  "createdAt": "2025-01-01T00:00:00.000Z",
  "teaser": "Jak działała straż i po co dobudowano Barbakan?",
  "variants": {
    "children": {
      "title": "Strażnicy i Barbakan",
      "content": "Strażnicy kontrolowali wjazdy, pobierali cła i w razie ataku bronili dostępu do miasta. Na górnych kondygnacjach były stanowiska dla łuczników, kuszników, a później strzelców. Brama była miejscem codziennej pracy, ale też punktem narażonym na ataki. W XV wieku dobudowano Barbakan jako wysunięte przedbramie, połączone z Bramą Floriańską krytym przejściem. Barbakan przyjmował pierwszy impet ataku, a napastnicy musieli przejść długi, ciasny korytarz, zanim dotarli do bramy. Dzięki temu krakowskie fortyfikacje były wyjątkowo skuteczne."
    },
    "casual": {
      "content": "Strażnicy pilnowali wjazdów, pobierali cła i w razie ataku bronili dostępu do miasta. Na górnych kondygnacjach mieli stanowiska: najpierw łucznicy i kusznicy, później strzelcy. Na co dzień robota jak robota, ale w razie czego to był punkt narażony na ataki. W XV wieku dobudowano Barbakan jako wysunięte przedbramie, połączone z Bramą Floriańską krytym przejściem. Barbakan brał na klatę pierwszy impet, a napastnicy musieli przemęczyć długi, ciasny korytarz, zanim w ogóle dobrali się do bramy. Ten system robił z krakowskich fortyfikacji naprawdę skuteczną ochronę."
    }
  }
}