{
    "nodes": [
      {
        "id": "root_brama",
        "title": "Brama Floriańska — wprowadzenie",
        "text": "Brama Floriańska to najważniejsza zachowana brama miejska Krakowa, będąca częścią średniowiecznego systemu fortyfikacji. Przez ponad 700 lat pełniła funkcję militarnego wejścia do miasta, punktu kontroli handlu oraz ceremonialnego początku Drogi Królewskiej. Jej architektura, symbolika i historia tworzą wielowarstwową opowieść o obronności, prestiżu i ciągłości miejskiej tradycji.",
        "tags": ["wprowadzenie"],
        "attachments": [
          {
            "id": "img_root",
            "type": "image",
            "url": "https://picsum.photos/seed/brama-main/800/450",
            "description": "Widok ogólny Bramy Floriańskiej"
          }
        ]
      },
  
      {
        "id": "hist_powstanie",
        "title": "Powstanie i funkcja średniowieczna",
        "text": "Brama powstała w końcu XIII wieku jako część odbudowy Krakowa po najazdach tatarskich. Razem z murami i ponad 40 basztami tworzyła jeden z najnowocześniejszych systemów obronnych regionu. Jej rola była dwojaka: militarna i administracyjna. Kontrolowano tu ruch kupców, pobierano cła i rejestrowano przyjezdnych. W pierwszym okresie brama była niższa, surowsza i w pełni podporządkowana funkcji obrony północnego odcinka miasta.",
        "tags": ["historia"],
        "attachments": [
          {
            "id": "img_hist_powstanie",
            "type": "image",
            "url": "https://picsum.photos/seed/medieval-walls/400/300",
            "description": "Średniowieczne fortyfikacje miejskie"
          }
        ]
      },

      {
        "id": "hist_gotyk_renesans",
        "title": "Gotycka przebudowa i rozwój renesansowy",
        "text": "W XIV–XV wieku bramę znacznie podwyższono i nadano jej gotycki charakter: ostrołukowy przejazd, wąskie strzelnice, masywne mury i wyraźny podział kondygnacji. Z tego okresu pochodzi jej monumentalna forma, widoczna z daleka jako symbol potęgi miasta. Powiększenie bramy wiązało się także z prestiżem — w tym czasie Kraków był centrum politycznym i gospodarczym, a przez bramę wjeżdżali królowie i ważne delegacje. W epoce renesansu bramę modernizowano: dodano bardziej eleganckie obramienia, poprawiono dachy, wzmocniono ganek obronny i usprawniono system odprowadzania wody. Straż otrzymała wygodniejsze pomieszczenia, a brama coraz bardziej łączyła funkcję obronną z reprezentacyjną.",
        "tags": ["historia"],
        "attachments": [
          {
            "id": "img_hist_gotyk",
            "type": "image",
            "url": "https://picsum.photos/seed/gothic-arch/400/300",
            "description": "Gotycka architektura obronna"
          }
        ]
      },

      {
        "id": "hist_upadek_ocalenie",
        "title": "Utrata znaczenia i ocalenie w XIX wieku",
        "text": "Od XVII wieku klasyczne wysokie mury przestały odpowiadać nowym realiom wojennym. Artyleria czyniła je mniej skutecznymi, a utrzymanie kosztowało coraz więcej. Wraz z zaniedbaniem murów brama zaczęła tracić znaczenie militarne. Fosy zasypywano, baszty wykorzystywano jako magazyny, a cała linia murów uznawana była za przeszkodę w rozwoju urbanistycznym. W latach 1817–1830 planowano zburzyć całą linię murów i Bramę Floriańską. Ocalono ją dzięki interwencji Feliksa Radwańskiego, który argumentował, że jej zniszczenie byłoby utratą tożsamości miasta. W tym czasie rozpoczęto restaurację i nadano bramie symboliczny charakter — stała się świadectwem historii i polskiej kultury w okresie zaborów.",
        "tags": ["historia"],
        "attachments": [
          {
            "id": "img_hist_upadek",
            "type": "image",
            "url": "https://picsum.photos/seed/restoration-19c/400/300",
            "description": "Restauracja bramy w XIX wieku"
          }
        ]
      },
  
      {
        "id": "arch_materialy",
        "title": "Materiały i konstrukcja",
        "text": "Dolne partie bramy wykonano z lokalnego wapienia, trwałego i podatnego na obróbkę. Wyższe kondygnacje zbudowano z cegły, co zmniejszało ciężar konstrukcji. Grubość murów w przyziemiu przekraczała 2 metry. Wewnątrz znajdowały się drewniane stropy, później wzmacniane podczas restauracji. Łączone materiały tworzą hybrydową, stabilną konstrukcję typową dla krakowskich budowli obronnych.",
        "tags": ["architektura"],
        "attachments": [
          {
            "id": "img_arch_materialy",
            "type": "image",
            "url": "https://picsum.photos/seed/stone-brick/400/300",
            "description": "Kamienne i ceglane mury"
          }
        ]
      },

      {
        "id": "arch_uklad",
        "title": "Układ przestrzenny i system obronny",
        "text": "Brama miała masywny przejazd zamykany wrotami i żelazną kratą. Nad przejazdem znajdowały się pomieszczenia straży. Spiralne schody w grubości murów łączyły kondygnacje, a strzelnice rozmieszczono tak, aby bronić podejścia do bramy. Układ podporządkowano maksymalnemu spowolnieniu napastnika i ułatwieniu obrony. W XIX wieku dodano barokowy kartusz z orłem białym z inicjatywy Jana Matejki. Od północy umieszczono płaskorzeźbę św. Floriana.",
        "tags": ["architektura", "symbolika"],
        "attachments": [
          {
            "id": "img_arch_uklad",
            "type": "image",
            "url": "https://picsum.photos/seed/defensive-structure/400/300",
            "description": "System obronny z strzelnicami"
          }
        ]
      },
  
      {
        "id": "mil_straz_barbakan",
        "title": "Straż i współpraca z Barbakanem",
        "text": "Strażnicy kontrolowali wjazdy, pobierali cła i w razie ataku bronili dostępu do miasta. W górnych kondygnacjach znajdowały się stanowiska dla łuczników, kuszników i później strzelców. Brama była zarówno punktem codziennej pracy, jak i miejscem narażonym na ataki. W XV wieku dobudowano Barbakan jako wysunięte przedbramie, połączone z Bramą Floriańską krytym przejściem. Barbakan przejmował pierwszy impet ataku, a napastnicy musieli pokonać długi, ciasny korytarz zanim dotarli do bramy. Ten system czynił krakowskie fortyfikacje wyjątkowo skutecznymi.",
        "tags": ["militaria"],
        "attachments": [
          {
            "id": "img_mil_barbakan",
            "type": "image",
            "url": "https://picsum.photos/seed/barbican-guard/400/300",
            "description": "Barbakan i system obronny"
          }
        ]
      },
  
      {
        "id": "cult_ceremonie_handel",
        "title": "Droga Królewska i handel",
        "text": "Przez Bramę Floriańską wjeżdżali królowie, posłowie i uczestnicy uroczystości państwowych. Podczas ceremonii dekorowano ją chorągwiami i zielenią. Była symbolicznym przejściem ze strefy zewnętrzej do reprezentacyjnego wnętrza miasta. Przez bramę wjeżdżali kupcy i wozacy z Kleparza i Małopolski. W pobliżu kwitł handel, działały warsztaty, a cechy rzemieślnicze miały obowiązki związane z utrzymaniem fragmentów murów. Brama była ekonomicznym filtrem i ważnym węzłem ruchu towarowego.",
        "tags": ["kultura", "gospodarka"],
        "attachments": [
          {
            "id": "img_cult_handel",
            "type": "image",
            "url": "https://picsum.photos/seed/royal-road/400/300",
            "description": "Droga Królewska i miejskie życie"
          }
        ]
      },

      {
        "id": "cult_legendy",
        "title": "Legendy i symbolika św. Floriana",
        "text": "Według lokalnej tradycji św. Florian chronił północny odcinek miasta i samą bramę przed pożarami. Jego wizerunek umieszczono na fasadzie jako symbol ochrony i opieki nad strażnikami. Legenda ta nie jest związana z samą budową bramy, ale została z nią kulturowo spleciona. Te dekoracje nadały bramie wymiar symboliczny i narodowy, przekształcając ją z obiektu stricte militarnego w ikonę kultury i historii.",
        "tags": ["kultura", "legendy"],
        "attachments": [
          {
            "id": "img_cult_legendy",
            "type": "image",
            "url": "https://picsum.photos/seed/saint-florian/400/300",
            "description": "Płaskorzeźba św. Floriana"
          }
        ]
      },

      {
        "id": "cult_wysokosc_matejko",
        "title": "Wysokość bramy i rola Jana Matejki",
        "text": "Brama ma około 33 metrów wysokości, co czyni ją jedną z najwyższych bram obronnych w tej części Europy. Wysokość zapewniała pole obserwacji i budowała wrażenie potęgi miasta. Konstrukcja łączy masywne kamienne przyziemie z lżejszą ceglaną nadbudową oraz spiralnymi schodami i licznymi otworami strzelniczymi. Jan Matejko uważał Bramę Floriańską za ważny symbol polskiej historii. To dzięki niemu na fasadzie od strony miasta umieszczono barokowego orła białego, który miał przypominać o tradycji narodowej w okresie zaborów. Jego interwencje nadały bramie dodatkową warstwę znaczeń kulturowych.",
        "tags": ["kultura", "ciekawostki", "postacie"],
        "attachments": [
          {
            "id": "img_cult_matejko",
            "type": "image",
            "url": "https://picsum.photos/seed/polish-eagle/400/300",
            "description": "Barokowy orzeł biały na fasadzie"
          }
        ]
      }
    ],
    "edges": [
      { "from": "root_brama", "to": "hist_powstanie" },
      { "from": "root_brama", "to": "hist_gotyk_renesans" },
      { "from": "root_brama", "to": "hist_upadek_ocalenie" },
      { "from": "root_brama", "to": "arch_materialy" },
      { "from": "root_brama", "to": "arch_uklad" },
      { "from": "root_brama", "to": "mil_straz_barbakan" },
      { "from": "root_brama", "to": "cult_ceremonie_handel" },
      { "from": "root_brama", "to": "cult_legendy" },
      { "from": "root_brama", "to": "cult_wysokosc_matejko" }
    ]
  }
